# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
data = {"Numbers" : [4,8,15,16,23,42]}

In [4]:
df = pd.DataFrame(data)

In [5]:
print(df)

   Numbers
0        4
1        8
2       15
3       16
4       23
5       42

In [8]:
type(df["Numbers"])

pandas.core.series.Series

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [14]:
list_ = [10,20,30,40,50,60,70,80,90,100]

In [16]:
my_list = pd.Series(list_)

In [17]:
print(my_list)

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:

In [18]:
data1 = {"Name" : ["Alice" , "Bob", "Claire"], "Age" : [25,30,27], "Gender" : ["Female" , "Male", "Female"]
}

In [22]:
pd.DataFrame(data1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [20]:
Q3_Data_Frame = pd.DataFrame(data1)

In [21]:
print(Q3_Data_Frame)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional size-mutable, tabular data structure with rows and columns, whereas a Pandas Series is a one-dimensional labeled array capable of holding data of any type.

A DataFrame is a collection of Series objects, and each Series represents a column in the DataFrame. It is a tabular data structure that contains a set of observations or data points, each represented as a row, with each column containing a different feature or attribute of the data point.

In contrast, a Series is a one-dimensional labeled array that can hold any data type. It has only one column of data and an index that represents the row labels.

Example:
Let's consider an example to demonstrate the difference between DataFrame and Series:

In [23]:
# I am taking example of Q3

# This is a data frame
pd.DataFrame(data1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [26]:
Q3_Data_Frame = pd.DataFrame(data1)
print (type(Q3_Data_Frame))

<class 'pandas.core.frame.DataFrame'>

In [29]:
# This is a series
Q3_Data_Frame["Name"]

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [28]:
name_series = Q3_Data_Frame["Name"]
print (type(name_series))

<class 'pandas.core.series.Series'>

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

There are many functions available in Pandas to manipulate data in a DataFrame. Some common functions include:

* head() and tail(): These functions allow you to view the first or last n rows of a DataFrame, respectively. They can be useful for quickly checking the structure and content of a DataFrame.

* info(): This function provides information about a DataFrame, including the number of non-null values and data types of each column.

* describe(): This function generates descriptive statistics for a DataFrame, including the count, mean, standard deviation, minimum, and maximum values.

* groupby(): This function is used to group a DataFrame by one or more columns, allowing you to perform aggregate functions on the groups. For example, you might use groupby() to calculate the average value of a column for each group.

* pivot_table(): This function is used to create a pivot table from a DataFrame. A pivot table is a way of summarizing data by grouping and aggregating it.

* apply(): This function applies a function to each element of a DataFrame, either row-wise or column-wise. This can be useful for performing custom transformations on your data.

In [2]:
# Example
## If i have to read any data present in any html file present in the url I can do this as :
import lxml
pd.read_html('https://www.basketball-reference.com/leagues/NBA_2015_totals.html')

[      Rk          Player Pos Age   Tm   G  GS    MP   FG  FGA  ...   FT%  ORB  \
 0      1      Quincy Acy  PF  24  NYK  68  22  1287  152  331  ...  .784   79
 1      2    Jordan Adams  SG  20  MEM  30   0   248   35   86  ...  .609    9
 2      3    Steven Adams   C  21  OKC  70  67  1771  217  399  ...  .502  199
 3      4     Jeff Adrien  PF  28  MIN  17   0   215   19   44  ...  .579   23
 4      5   Arron Afflalo  SG  29  TOT  78  72  2502  375  884  ...  .843   27
 ..   ...             ...  ..  ..  ...  ..  ..   ...  ...  ...  ...   ...  ...
 670  490  Thaddeus Young  PF  26  TOT  76  68  2434  451  968  ...  .655  127
 671  490  Thaddeus Young  PF  26  MIN  48  48  1605  289  641  ...  .682   75
 672  490  Thaddeus Young  PF  26  BRK  28  20   829  162  327  ...  .606   52
 673  491     Cody Zeller   C  22  CHO  62  45  1487  172  373  ...  .774   97
 674  492    Tyler Zeller   C  25  BOS  82  59  1731  340  619  ...  .823  146

      DRB  TRB  AST  STL BLK  TOV   PF   PTS
 0    222  301   68   27  22   60  147   398
 1     19   28   16   16   7   14   24    94
 2    324  523   66   38  86   99  222   537
 3     54   77   15    4   9    9   30    60
 4    220  247  129   41   7  116  167  1035
 ..   ...  ...  ...  ...  ..  ...  ...   ...
 670  284  411  173  124  25  117  171  1071
 671  170  245  135   86  17   75  115   685
 672  114  166   38   38   8   42   56   386
 673  265  362  100   34  49   62  156   472
 674  319  465  113   18  52   76  205   833

 [675 rows x 30 columns]]

In [7]:
pip install lxml

Collecting lxml
  Downloading lxml-4.9.2-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.manylinux_2_24_x86_64.whl (7.1 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 7.1/7.1 MB 31.6 MB/s eta 0:00:0000:0100:01
Installing collected packages: lxml
Successfully installed lxml-4.9.2
Note: you may need to restart the kernel to use updated packages.

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

* Series and DataFrame are mutable in nature, while Panel is immutable.

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [19]:
name = pd.Series(['sumit', 'rimmi', 'umang', 'raghav'])
age = pd.Series([25, 30, 35, 40])
city = pd.Series(['Aligarh', 'delhi', 'agra', 'bombay'])

In [22]:
pd.DataFrame({'Name': name, 'Age': age, 'City': city})

     Name  Age     City
0   sumit   25  Aligarh
1   rimmi   30    delhi
2   umang   35     agra
3  raghav   40   bombay

In [20]:
df = pd.DataFrame({'Name': name, 'Age': age, 'City': city})

In [21]:
print(df)

     Name  Age     City
0   sumit   25  Aligarh
1   rimmi   30    delhi
2   umang   35     agra
3  raghav   40   bombay